public/phases/Ecosystem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-24 Sun 17:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ecosystem Roadmap</title>
<meta name="author" content="Dowland Aiello" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../theme/rethink.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ecosystem Roadmap</h1>

<div id="outline-container-orge225b75" class="outline-2">
<h2 id="orge225b75"><span class="todo TODO">TODO</span> Ecosystem Features <code>[0/3]</code></h2>
<div class="outline-text-2" id="text-orge225b75">
<p>
DEADLINE: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-10-31 Mon&gt;</span></span>
</p>

<p>
Modules that implement important qualify-of-life features, and features that will greatly increase the growth rate of the Vision ecosystem by lowering barriers to entry, and enhancing the Vision experience overall.
</p>

<ul class="org-ul">
<li><i>ETA: Oct 2022</i></li>
</ul>
</div>

<div id="outline-container-org76409cf" class="outline-3">
<h3 id="org76409cf"><span class="todo TODO">TODO</span> Web-Accessible Staking / Pinning Interface <code>[0/1]</code></h3>
<div class="outline-text-3" id="text-org76409cf">
<p>
Implements a web-facing interface to the Vision pinning marketplace and quadratic voting enforcement mechanism, for use by any Vision user. Expands accessibility of staking features from power-users to all Vision users.
</p>
</div>

<div id="outline-container-orgcd52637" class="outline-4">
<h4 id="orgcd52637"><span class="todo TODO">TODO</span> Stake Pooling</h4>
<div class="outline-text-4" id="text-orgcd52637">
<p>
An expansion to the Vision pinning marketplace that allows users to pool together staking resources for use by a delegated validator. Allows users that do not have access to a persistent internet connection to reap staking rewards, and confer risk to another party.
</p>
</div>
</div>
</div>

<div id="outline-container-org6fb468a" class="outline-3">
<h3 id="org6fb468a"><span class="todo TODO">TODO</span> Expanded Module Language Support <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-org6fb468a">
<p>
A suite of upgrades to the Vision module system that make developing Vision modules accessible to developers with a wider array of backgrounds and technical experience.
</p>
</div>

<div id="outline-container-org9e12a8e" class="outline-4">
<h4 id="org9e12a8e"><span class="todo TODO">TODO</span> Enhanced Bindings for Popular Languages</h4>
<div class="outline-text-4" id="text-org9e12a8e">
<p>
Enhance developer user experience by providing convenient wrappers for Vision API functionality in popular languages. Aim for feature parity across all "enhanced-support" languages.
</p>
</div>
</div>

<div id="outline-container-orga5a423e" class="outline-4">
<h4 id="orga5a423e"><span class="todo TODO">TODO</span> Expanded Documentation &amp; Examples</h4>
<div class="outline-text-4" id="text-orga5a423e">
<p>
Prepare expanded documentation, and example materials for Vision developers in popular languages, including: TypeScript, Python, Rust, and C++.
</p>
</div>
</div>

<div id="outline-container-orgc31f109" class="outline-4">
<h4 id="orgc31f109"><span class="todo TODO">TODO</span> "No-Code" / Block-coding Module Development Interface</h4>
<div class="outline-text-4" id="text-orgc31f109">
<p>
Implement a block coding-based Vision module generator, accessible to audiences with very little blockchain, or coding experience.
</p>
</div>
</div>
</div>

<div id="outline-container-org07a95ee" class="outline-3">
<h3 id="org07a95ee"><span class="todo TODO">TODO</span> Vision Decentralized ID <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-org07a95ee">
<p>
A Vision module that implements the W3C DID standard, for usage in Vision collaborative tools, for proposal and DAO metadata, and for upcoming social features.
</p>
</div>

<div id="outline-container-orgc553f04" class="outline-4">
<h4 id="orgc553f04"><span class="todo TODO">TODO</span> Vision User Profiles</h4>
<div class="outline-text-4" id="text-orgc553f04">
<p>
A vision module that allows users to create non-fungible identity DAO's that represent the concept of themselves. Allows identities to be transferred between accounts. Allows for social recovery of a user's identity by delegating ownership logic to a DAO formed by a user's friends and family, for example.
</p>
</div>
</div>

<div id="outline-container-org5a61a86" class="outline-4">
<h4 id="org5a61a86"><span class="todo TODO">TODO</span> Expanded social functions</h4>
<div class="outline-text-4" id="text-org5a61a86">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Functionality for following other users</li>
<li class="off"><code>[&#xa0;]</code> Viewing statistics about a particular user, including their "idea net worth"</li>
<li class="off"><code>[&#xa0;]</code> Visualizing relationships between users through Vision's "mind map"</li>
<li>Generalizable to enhance digital money and web3 applications in general by allowing cryptocurrency users, regardless of blockchain, to track interactions with each other, relationships, and identities, without sharing infrastructure like the Ethereum Name Service</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 06/22/2022</p>
<p class="author">Author: Dowland Aiello</p>
<p class="date">Created: 2022-07-24 Sun 17:22</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
